export const TextbookData = [
  {
    id: 1,
    title: "Ⅰ. 자신과의 관계",
    chapters: [
      {
        id: 1,
        title: "1. 왜 도덕적으로 살아야 하는가?",
        sections: [
          { id: 1, title: "01. 사람을 사람답게 만드는 것은 무엇인가?" },
          { id: 2, title: "02. 도덕은 무엇이고 왜 필요한가?" },
          { id: 3, title: "03. 내가 도덕적이어야 하는 이유는 무엇일까?" },
        ],
      },
      {
        id: 2,
        title: "2. 도덕적으로 행동하기 위해 필요한 것은 무엇인가?",
        sections: [
          { id: 4, title: "01. 우리는 왜 도덕적 행동을 하지 못하는가?" },
          { id: 5, title: "02. 도덕적 상상력과 민감성의 역할은 무엇인가?" },
          { id: 6, title: "03. 도덕적 추론과 비판적 사고는 어떻게 하는가?" },
          { id: 7, title: "04. 내가 할 수 있는 도덕적 성찰의 방법은 무엇일까?" },
        ],
      },
      {
        id: 3,
        title: "3. 나는 어떤 사람이 되고자 하는가?",
        sections: [
          { id: 8, title: "01. 나는 누구인가?" },
          { id: 9, title: "02. 내가 존경하는 도덕적 인물은 누구인가?" },
          { id: 10, title: "03. 나의 신념은 무엇인가?" },
        ],
      },
       {
        id: 4,
        title: "4. 삶의 목적은 무엇인가?",
        sections: [
          { id: 11, title: "01. 나는 어떤 가치를 추구하는가?" },
          { id: 12, title: "02. 내 삶의 목적은 무엇인가?" },
          { id: 13, title: "03. 도덕 공부의 진정한 의미와 목적은 무엇인가?" },
        ],
      },
      {
        id: 5,
        title: "5. 행복을 위해 어떻게 살아야 하는가?",
        sections: [
          { id: 14, title: "01. 행복이란 무엇인가?" },
          { id: 15, title: "02. 행복한 삶을 위해 좋은 습관이 필요한 이유는?" },
          { id: 16, title: "03. 정서적 건강과 사회적 건강을 어떻게 가꿀까?" },
        ],
      },
    ],
  },
  {
    id: 2,
    title: "Ⅱ. 타인과의 관계",
    chapters: [
      {
        id: 1,
        title: "1. 가정에서의 갈등을 어떻게 해결할 것인가?",
        sections: [
          { id: 1, title: "01. 가정은 어떻게 생겨나고, 어떤 갈등이 발생할 수 있을까?" },
          { id: 2, title: "02. 오늘날 효란 무엇이며 가족 사이의 도리를 어떻게 실천할 것인가?" },
          { id: 3, title: "03. 세대 간 대화와 소통을 어떻게 할까?" },
        ],
      },
      {
        id: 2,
        title: "2. 참된 우정이란 무엇인가?",
        sections: [
          { id: 4, title: "01. 우정이란 무엇이고 왜 중요한가?" },
          { id: 5, title: "02. 진정한 친구란 누구인가?" },
          { id: 6, title: "03. 진정한 우정을 맺기 위한 방법은 무엇일까?" },
        ],
      },
      {
        id: 3,
        title: "3. 성의 도덕적 의미는 무엇인가?",
        sections: [
          { id: 7, title: "01. 내가 생각하는 성과 사랑의 의미는 무엇인가?" },
          { id: 8, title: "02. 청소년기의 바람직한 성 윤리는 무엇일까?" },
          { id: 9, title: "03. 이성 친구와 바람직한 관계를 형성하는 방법은 무엇일까?" },
        ],
      },
      {
        id: 4,
        title: "4. 이웃에 대한 바람직한 자세는 무엇인가?",
        sections: [
          { id: 10, title: "01. 누가 나의 이웃일까?" },
          { id: 11, title: "이웃과의 관계에서 필요한 도덕적 자세는 무엇일까?" },
        ],
      },
    ],
  },
  {
    id: 3,
    title: "Ⅲ. 사회‧공동체와의 관계",
    chapters: [
      {
        id: 1,
        title: "1. 인권의 도덕적 의미는 무엇인가?",
        sections: [
          { id: 1, title: "01. 인간 존엄성과 인권이 소중한 이유는 무엇인가?" },
          { id: 2, title: "02. 사회적 약자를 어떻게 대할 것인가?" },
          { id: 3, title: "03. 양성평등을 어떻게 실천할 수 있을까?" },
        ],
      },
      {
        id: 2,
        title: "2. 다문화 사회에서 발생하는 갈등을 어떻게 해결할 것인가?",
        sections: [
          { id: 4, title: "01. 우리 안에 있는 다문화의 모습은 무엇인가?" },
          { id: 5, title: "02. 자문화와 타 문화를 어떻게 바라볼 것인가?" },
          { id: 6, title: "03. 다문화 사회의 갈등을 해결하려면 어떻게 해야 할까?" },
        ],
      },
      {
        id: 3,
        title: "3. 세계 시민으로서 도덕적 과제는 무엇인가?",
        sections: [
          { id: 7, title: "01. 나는 세계 시민인가?" },
          { id: 8, title: "02. 세계 시민이 직면하는 도덕 문제는 무엇인가?" },
          { id: 9, title: "03. 세계 시민이 직면하는 도덕 문제를 어떻게 해결할 수 있을까?" },
        ],
      },
    ],
  },
];
